#+TITLE: November 23, 2018-December 7, 2018 (15 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO                                                | NEXT | IN_PROGRESS                                         | WAITING | DONE                                         | CANCELED |
|-----------------------------------------------------+------+-----------------------------------------------------+---------+----------------------------------------------+----------|
| READ.1541589764. [#A] Computer Network              |      | DEV.1538995712. [#A] Freecodecamp Javascript Algori |         | EVENT.1542904460. Go Girls Pune (2018-11-25) |          |
| DEV.1541590094. [#A] [[https://docs.djangoproject.c |      | READ.1542902097. Learning Golang Chapter 7. Int     |         |                                              |          |
|                                                     |      | DEV.1542902280. Learning Golang Chapter 7 Exer      |         |                                              |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME             | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|------------------+-----------+--------+------+-----------+--------------+------------|
| Vaibhavk         |      11.5 |      0 |    0 |      11.5 |   2018-12-19 | ---------- |
| Sidntrivedi012   |         4 |   1.07 |    0 |         4 |   2018-12-17 | ---------- |
| Nightwarrior-Xxx |         0 |      0 |    0 |         0 |   2018-12-05 | ---------- |
| Bhavin192        |     20.25 |  16.25 |   10 |     10.25 |   2018-12-18 | #####----- |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph

#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:15]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED  |
|-----+------------+--------+-------+------------------|
|   1 | 2018-11-23 |  64.25 |    60 |                  |
|   2 | 2018-11-24 |  64.25 |    56 |                  |
|   3 | 2018-11-25 |  54.25 |    51 | EVENT.1542904460 |
|   4 | 2018-11-26 |  54.25 |    47 |                  |
|   5 | 2018-11-27 |  54.25 |    43 |                  |
|   6 | 2018-11-28 |  54.25 |    39 |                  |
|   7 | 2018-11-29 |  54.25 |    34 |                  |
|   8 | 2018-11-30 |  54.25 |    30 |                  |
|   9 | 2018-12-01 |  54.25 |    26 |                  |
|  10 | 2018-12-02 |  54.25 |    21 |                  |
|  11 | 2018-12-03 |  54.25 |    17 |                  |
|  12 | 2018-12-04 |  54.25 |    13 |                  |
|  13 | 2018-12-05 |  54.25 |     9 |                  |
|  14 | 2018-12-06 |        |     4 |                  |
|  15 | 2018-12-07 |        |     0 |                  |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                            | TASKID           | OWNER            | PRIORITY | TODO        | ESTIMATED | ACTUAL |
|-----------------------------------------------------------------+------------------+------------------+----------+-------------+-----------+--------|
| TASKS                                                           |                  |                  | B        |             |     64.25 |  17.32 |
|-----------------------------------------------------------------+------------------+------------------+----------+-------------+-----------+--------|
| bhavin192                                                       |                  |                  | B        |             |     20.25 |  16.25 |
| Learning Golang Chapter 7. Interfaces                           | READ.1542902097  | bhavin192        | B        | IN_PROGRESS |      4.75 |   2.03 |
| Learning Golang Chapter 7 Exercises                             | DEV.1542902280   | bhavin192        | B        | IN_PROGRESS |       5.5 |   5.60 |
| Go Girls Pune                                                   | EVENT.1542904460 | bhavin192        | B        | DONE        |        10 |   8.62 |
|-----------------------------------------------------------------+------------------+------------------+----------+-------------+-----------+--------|
| nightwarrior-xxx                                                |                  |                  | B        |             |        22 |        |
| Fun with graph theory                                           | READ.1542000533  | nightwarrior-xxx | B        |             |        12 |        |
| Learning Cryptography                                           | READ.1542000612  | nightwarrior-xxx | B        |             |        10 |        |
|-----------------------------------------------------------------+------------------+------------------+----------+-------------+-----------+--------|
| sidntrivedi012                                                  |                  |                  | B        |             |         4 |   1.07 |
| Freecodecamp Javascript Algorithms and Data Structures - Part I | DEV.1538995712   | sidntrivedi012   | A        | IN_PROGRESS |         4 |   1.07 |
|-----------------------------------------------------------------+------------------+------------------+----------+-------------+-----------+--------|
| vaibhavk                                                        |                  |                  | B        |             |      18.0 |        |
| Computer Network                                                | READ.1541589764  | vaibhavk         | A        | TODO        |         4 |        |
| [[https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/6/html/resource_management_guide/ch01][Control Groups]]                                                  | READ.1541589889  | vaibhavk         | B        |             |       5.5 |        |
| [[https://docs.djangoproject.com/en/2.1/intro/][Django Project]] - II                                             | DEV.1541590094   | vaibhavk         | A        | TODO        |       7.5 |        |
| [[https://youtu.be/4XpnKHJAok8][Trovald's Git Talk]]                                              | read.1543297783  | vaibhavk         | B        |             |         1 |        |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 15
  :SPRINTSTART: <2018-11-23 Fri>
  :wpd-bhavin192: 1.25
  :wpd-sidntrivedi012: 0.5
  :wpd-vaibhavk: 1.2
  :END:
** bhavin192
*** DONE Learning Golang Chapter 7. Interfaces [8/8]
    CLOSED: [2018-12-07 Fri 23:07]
    :PROPERTIES:
    :ESTIMATED: 4.75
    :ACTUAL:   3.53
    :OWNER:    bhavin192
    :ID:       READ.1542902097
    :TASKID:   READ.1542902097
    :END:
    :LOGBOOK:
    CLOCK: [2018-12-07 Fri 23:02]--[2018-12-07 Fri 23:07] =>  0:05
    CLOCK: [2018-12-05 Wed 21:51]--[2018-12-05 Wed 22:04] =>  0:13
    CLOCK: [2018-12-05 Wed 21:21]--[2018-12-05 Wed 21:44] =>  0:23
    CLOCK: [2018-12-05 Wed 21:04]--[2018-12-05 Wed 21:21] =>  0:17
    CLOCK: [2018-12-04 Tue 22:29]--[2018-12-04 Tue 22:39] =>  0:10
    CLOCK: [2018-12-04 Tue 22:07]--[2018-12-04 Tue 22:29] =>  0:22
    CLOCK: [2018-11-27 Tue 21:43]--[2018-11-27 Tue 22:05] =>  0:22
    CLOCK: [2018-11-27 Tue 19:02]--[2018-11-27 Tue 19:42] =>  0:40
    CLOCK: [2018-11-26 Mon 21:49]--[2018-11-26 Mon 22:25] =>  0:36
    CLOCK: [2018-11-26 Mon 19:29]--[2018-11-26 Mon 19:53] =>  0:24
    :END:
    - [X] 7.8 The error Interface (15m)
    - [X] 7.9 Example: Expression Evaluator (120m)
    - [X] 7.10 Type Assertions (20m)
    - [X] 7.11 Discriminating Errors with Type Assertions (15m)
    - [X] 7.12 Querying Behaviors with Interface Type Assertions (30m)
    - [X] 7.13 Type Switches (40m)
    - [X] 7.14 Example: Token-Based XML Decoding (40m)
    - [X] 7.15 A Few Words of Advice (5m)
*** DONE Learning Golang Chapter 7 Exercises [3/3]
    CLOSED: [2018-12-07 Fri 23:58]
    :PROPERTIES:
    :ESTIMATED: 5.5
    :ACTUAL:   6.48
    :OWNER:    bhavin192
    :ID:       DEV.1542902280
    :TASKID:   DEV.1542902280
    :END:
    :LOGBOOK:
    CLOCK: [2018-12-07 Fri 23:14]--[2018-12-07 Fri 23:58] =>  0:44
    CLOCK: [2018-12-06 Thu 19:47]--[2018-12-06 Thu 19:56] =>  0:09
    CLOCK: [2018-12-04 Tue 19:23]--[2018-12-04 Tue 20:08] =>  0:45
    CLOCK: [2018-12-03 Mon 22:38]--[2018-12-03 Mon 22:58] =>  0:20
    CLOCK: [2018-12-03 Mon 22:00]--[2018-12-03 Mon 22:22] =>  0:22
    CLOCK: [2018-12-03 Mon 21:46]--[2018-12-03 Mon 22:00] =>  0:14
    CLOCK: [2018-12-03 Mon 20:59]--[2018-12-03 Mon 21:35] =>  0:36
    CLOCK: [2018-11-29 Thu 22:10]--[2018-11-29 Thu 22:32] =>  0:22
    CLOCK: [2018-11-29 Thu 19:45]--[2018-11-29 Thu 20:04] =>  0:19
    CLOCK: [2018-11-28 Wed 21:22]--[2018-11-28 Wed 22:28] =>  1:06
    CLOCK: [2018-11-28 Wed 19:31]--[2018-11-28 Wed 19:52] =>  0:21
    CLOCK: [2018-11-25 Sun 20:03]--[2018-11-25 Sun 20:09] =>  0:06
    CLOCK: [2018-11-24 Sat 17:17]--[2018-11-24 Sat 17:24] =>  0:07
    CLOCK: [2018-11-24 Sat 15:57]--[2018-11-24 Sat 16:55] =>  0:58
    :END:
    - [X] 7.7 (70m)
    - [X] 7.9 (150m)
    - [X] 7.14 (120m)
*** DONE Go Girls Pune
    CLOSED: [2018-11-25 Sun 17:24]
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:   8.62
    :OWNER:    bhavin192
    :ID:       EVENT.1542904460
    :TASKID:   EVENT.1542904460
    :END:
    :LOGBOOK:
    CLOCK: [2018-11-25 Sun 08:47]--[2018-11-25 Sun 17:24] =>  8:37
    :END:
** sidntrivedi012
*** IN_PROGRESS [#A] Freecodecamp Javascript Algorithms and Data Structures - Part I [0/1]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   1.07
    :OWNER:    sidntrivedi012
    :ID:       DEV.1538995712
    :TASKID:   DEV.1538995712
    :END:      
    :LOGBOOK:
    CLOCK: [2018-12-06 Thu 19:02]--[2018-12-06 Thu 20:05] =>  1:03
    CLOCK: [2018-12-06 Thu 19:00]--[2018-12-06 Thu 19:01] =>  0:01
    CLOCK: [2018-12-02 Sun 15:33]--[2018-12-02 Sun 16:04] =>  0:31
    CLOCK: [2018-11-30 Fri 15:32]--[2018-11-30 Fri 16:05] =>  0:33
    :END:
    - [ ] Basic Javascript
** vaibhavk
*** TODO [#A] Computer Network [0/1]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER:    vaibhavk
    :ID:       READ.1541589764
    :TASKID:   READ.1541589764
    :END:
    - [ ] Chapter 5. Link Layer: Link, Access Network, LAN (4h)
*** [[https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/6/html/resource_management_guide/ch01][Control Groups]] [0/4]
    :PROPERTIES:
    :ESTIMATED: 5.5
    :ACTUAL:
    :OWNER:    vaibhavk
    :ID:       READ.1541589889
    :TASKID:   READ.1541589889
    :END:
    - [ ] [[https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/6/html/resource_management_guide/sec-relationships_between_subsystems_hierarchies_control_groups_and_tasks][How and Why Cgroup]]                (1h)
    - [ ] [[https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/6/html/resource_management_guide/ch-using_control_groups][Using Cgroups]]                     (1h 30m)
    - [ ] [[https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/6/html/resource_management_guide/ch-subsystems_and_tunable_parameters][Subsystems and Tunable Parameters]] (1h 30m)
    - [ ] [[https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/6/html/resource_management_guide/control-group-application-examples][Applications examples]]             (1h 30m)
*** TODO [#A] [[https://docs.djangoproject.com/en/2.1/intro/][Django Project]] - II [0/4]
    :PROPERTIES:
    :ESTIMATED: 7.5
    :ACTUAL:
    :OWNER:    vaibhavk
    :ID:       DEV.1541590094
    :TASKID:   DEV.1541590094
    :END:
    1) [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial05/][Poll App, Part 5]] (2h 30m)
    2) [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial06/][Poll App, Part 6]] (1h)
    3) [ ] [[https://docs.djangoproject.com/en/2.1/intro/tutorial07/][Poll App, Part 7]] (2h)
    4) [ ] [[https://docs.djangoproject.com/en/2.1/intro/reusable-apps/][Reusable Apps]]    (1h)
*** [#B] [[https://youtu.be/4XpnKHJAok8][Trovald's Git Talk]]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:
    :OWNER:    vaibhavk
    :ID:       read.1543297783
    :TASKID:   read.1543297783
    :END:

